In [1]:
#pip install pymysql
#pip install sqlalchemy_utils

Import Libraries

In [2]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pymysql
pymysql.install_as_MySQLdb()
username='root'
password='root'
connection=f"mysql+pymysql://{username}:{password}@localhost/DE-Books-Core"
engine=create_engine(connection)

Check for database, create if needed

In [3]:
## Check if database exists, if not, create it
if database_exists(connection) == False: create_database(connection)
else: print('The database already exists.')

Imnport data

In [44]:
# Import users data
user = pd.read_csv('data/users.csv')
user.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [45]:
# Data verified, create table
user.to_sql('user', engine, if_exists = 'replace')

In [46]:
# Import books table
book = pd.read_csv('data/books.csv')
book.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [47]:
# Data verified, create table
book.to_sql('book', engine, if_exists = 'replace')

In [48]:
# Import authors table
author = pd.read_csv('data/authors.csv')
author.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [49]:
# Data verified, create table
author.to_sql('author', engine, if_exists = 'replace')

In [50]:
# Import authors table
favorite = pd.read_csv('data/favorites.csv')
favorite.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [51]:
# Data verified, create table
favorite.to_sql('favorites', engine, if_exists = 'replace')

In [52]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_de-books-core
0                  author
1                    book
2               favorites
3                    user

Build the Query for John Doe's favorites

In [58]:
#
q = """

SELECT book.title, favorites.user_id
FROM book
JOIN favorites ON book.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT user.id FROM user WHERE (user.last_name = "Doe" AND user.first_name = "John"));"""

pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1